In [4]:
import pandas as pd

In [8]:
df = pd.read_excel(r"C:\Users\samer\Desktop\Machine Learning\Complementary Stuff\titanic.xls")
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [9]:
df.drop(['name','ticket','cabin','embarked', 'boat', 'body', 'home.dest'],axis='columns',inplace=True)
df.head()

   pclass  survived     sex      age  sibsp  parch      fare
0       1         1  female  29.0000      0      0  211.3375
1       1         1    male   0.9167      1      2  151.5500
2       1         0  female   2.0000      1      2  151.5500
3       1         0    male  30.0000      1      2  151.5500
4       1         0  female  25.0000      1      2  151.5500

In [11]:
inputs = df.drop('survived',axis='columns')
target = df.survived

In [13]:
dummies = pd.get_dummies(inputs.sex)
dummies.head(3)

   female  male
0       1     0
1       0     1
2       1     0

In [14]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   pclass     sex      age  sibsp  parch      fare  female  male
0       1  female  29.0000      0      0  211.3375       1     0
1       1    male   0.9167      1      2  151.5500       0     1
2       1  female   2.0000      1      2  151.5500       1     0

In [15]:
inputs.drop(['sex'],axis='columns',inplace=True)
inputs.head(3)

   pclass      age  sibsp  parch      fare  female  male
0       1  29.0000      0      0  211.3375       1     0
1       1   0.9167      1      2  151.5500       0     1
2       1   2.0000      1      2  151.5500       1     0

In [16]:
inputs.columns[inputs.isna().any()]

Index(['age', 'fare'], dtype='object')

In [20]:
inputs.age = inputs.age.fillna(inputs.age.mean())
inputs.fare = inputs.fare.fillna(inputs.fare.mean())

In [21]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [22]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [23]:
model.fit(X_train,y_train)

GaussianNB()

In [24]:
model.score(X_test,y_test)

0.7938931297709924

In [25]:
X_test[0:10]

      pclass        age  sibsp  parch     fare  female  male
21         1  47.000000      1      1  52.5542       1     0
988        3  29.881135      0      0   7.7500       0     1
755        3  17.000000      2      0   8.0500       0     1
601        3  13.000000      0      2  20.2500       0     1
511        2  62.000000      0      0   9.6875       0     1
1046       3  22.000000      0      0   7.8958       0     1
689        3  22.000000      1      0   7.2500       0     1
226        1  29.000000      1      0  66.6000       0     1
1004       3  29.881135      0      0   7.7875       1     0
434        2   7.000000      0      2  26.2500       1     0

In [26]:
y_test[0:10]

21      1
988     0
755     0
601     0
511     0
1046    0
689     0
226     0
1004    1
434     1
Name: survived, dtype: int64

In [27]:
model.predict(X_test[0:10])

array([1, 0, 0, 0, 0, 0, 0, 0, 1, 1], dtype=int64)

In [28]:
model.predict_proba(X_test[:10]) # probability he didnt survive and probability that he survived

array([[0.00527959, 0.99472041],
       [0.97780204, 0.02219796],
       [0.99381511, 0.00618489],
       [0.98575473, 0.01424527],
       [0.92944799, 0.07055201],
       [0.97568229, 0.02431771],
       [0.97693265, 0.02306735],
       [0.74067725, 0.25932275],
       [0.05837283, 0.94162717],
       [0.03574211, 0.96425789]])

In [29]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.8047619 , 0.77619048, 0.77033493, 0.78947368, 0.77033493])